In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv('train.csv')

In [92]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
PassengerId        891 non-null int64
Survived           891 non-null int64
Pclass             891 non-null int64
Name               891 non-null object
Sex                891 non-null int32
Age                891 non-null float64
SibSp              891 non-null int64
Parch              891 non-null int64
Ticket             891 non-null object
Fare               891 non-null float64
Cabin              204 non-null object
Embarked           891 non-null object
Family_Size        891 non-null int64
Fare_per_person    891 non-null float64
New_Variable       891 non-null float64
dtypes: float64(4), int32(1), int64(6), object(4)
memory usage: 101.0+ KB

In [5]:

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [82]:
median = test_data['Age'].median()

In [83]:
test_data_2['Age'] = test_data_2['Age'].fillna(median)

In [74]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
test_data_2['Sex'] = encoder.fit_transform(test_data_2['Sex'])

In [75]:
test_data_2['Family_Size']  = test_data_2['SibSp']  + test_data_2['Parch']

In [76]:
from sklearn.preprocessing import OneHotEncoder
encoder_1 = OneHotEncoder()
test_data_2['Embarked'] = test_data_2['Embarked'].fillna(0)

In [77]:
test_data_2['Fare_per_person'] = test_data_2['Fare'] / (test_data_2['Family_Size']+1)

In [54]:
test_data_1.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Family_Size,Fare_per_person
0,3,male,34.5,0,0,7.8292,Q,0,7.829200
1,3,female,47.0,1,0,7.0000,S,1,3.500000
2,2,male,62.0,0,0,9.6875,Q,0,9.687500
3,3,male,27.0,0,0,8.6625,S,0,8.662500
4,3,female,22.0,1,1,12.2875,S,2,4.095833

In [78]:
test_data_2['New_Variable'] = test_data_2['Age']*test_data_2['Pclass']

In [14]:
corr = data.corr()
corr['Survived'].sort_values(ascending = False)

Survived           1.000000
Fare               0.257307
Fare_per_person    0.221600
Parch              0.081629
Family_Size        0.016639
PassengerId       -0.005007
SibSp             -0.035322
Age               -0.064910
New_Variable      -0.324559
Pclass            -0.338481
Sex               -0.543351
Name: Survived, dtype: float64

In [15]:
data_1 = data.drop(['PassengerId','Ticket','Cabin','Name'],axis = 1)
# try removing other parameters too

In [16]:
data_1.head()
#try encoding Embarked

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Family_Size,Fare_per_person,New_Variable
0,0,3,1,22.0,1,0,7.2500,S,1,3.62500,66.0
1,1,1,0,38.0,1,0,71.2833,C,1,35.64165,38.0
2,1,3,0,26.0,0,0,7.9250,S,0,7.92500,78.0
3,1,1,0,35.0,1,0,53.1000,S,1,26.55000,35.0
4,0,3,1,35.0,0,0,8.0500,S,0,8.05000,105.0

In [17]:
data_2 = data_1.drop('Embarked',axis = 1)

In [18]:
data_2.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Family_Size,Fare_per_person,New_Variable
0,0,3,1,22.0,1,0,7.2500,1,3.62500,66.0
1,1,1,0,38.0,1,0,71.2833,1,35.64165,38.0
2,1,3,0,26.0,0,0,7.9250,0,7.92500,78.0
3,1,1,0,35.0,1,0,53.1000,1,26.55000,35.0
4,0,3,1,35.0,0,0,8.0500,0,8.05000,105.0

In [19]:
from sklearn.preprocessing import MinMaxScaler
scalar = MinMaxScaler()
data_2['Age'] = MinMaxScaler(data_2['Age'])

In [20]:
data_2['Fare'] = MinMaxScaler(data_2['Fare'])
data_2['Fare_per_person'] = MinMaxScaler(data_2['Fare_per_person'])
data_2['Family_Size'] = MinMaxScaler(data_2['Family_Size'])
data_2['New_Variable'] = MinMaxScaler(data_2['New_Variable'])

In [21]:
data_2.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Family_Size,Fare_per_person,New_Variable
0,0,3,1,"MinMaxScaler(copy=True,\n feature_range=...",1,0,"MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=..."
1,1,1,0,"MinMaxScaler(copy=True,\n feature_range=...",1,0,"MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=..."
2,1,3,0,"MinMaxScaler(copy=True,\n feature_range=...",0,0,"MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=..."
3,1,1,0,"MinMaxScaler(copy=True,\n feature_range=...",1,0,"MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=..."
4,0,3,1,"MinMaxScaler(copy=True,\n feature_range=...",0,0,"MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=...","MinMaxScaler(copy=True,\n feature_range=..."

In [22]:
data_1.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Family_Size,Fare_per_person,New_Variable
0,0,3,1,22.0,1,0,7.2500,S,1,3.62500,66.0
1,1,1,0,38.0,1,0,71.2833,C,1,35.64165,38.0
2,1,3,0,26.0,0,0,7.9250,S,0,7.92500,78.0
3,1,1,0,35.0,1,0,53.1000,S,1,26.55000,35.0
4,0,3,1,35.0,0,0,8.0500,S,0,8.05000,105.0

In [23]:
data_3 = data_1.drop('Embarked',axis=1)

In [24]:
X = data_3.drop('Survived',axis = 1)
y = data_3['Survived']

In [25]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2,random_state = 42)

In [26]:
from sklearn.linear_model import LogisticRegression
model_1 = LogisticRegression()
model_1.fit(X_train,y_train)
y_train_pred = model_1.predict(X_train)

C:\Users\dell\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [27]:
from sklearn.tree import DecisionTreeClassifier
model_2 = DecisionTreeClassifier()
model_2.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [28]:
y_train_pred_2 = model_2.predict(X_train)

In [29]:
from sklearn.metrics import confusion_matrix
cnfm = confusion_matrix(y_train,y_train_pred)
cnfm

array([[389,  55],
       [ 91, 177]], dtype=int64)

In [30]:
from sklearn.metrics import precision_score , recall_score
precision_score(y_train,y_train_pred)

0.7629310344827587

In [31]:
recall_score(y_train,y_train_pred)

0.6604477611940298

In [32]:
from sklearn.model_selection import cross_val_score
y_1 = cross_val_score(model_1,X_train,y_train,cv = 3, scoring = 'accuracy')

C:\Users\dell\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
C:\Users\dell\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
C:\Users\dell\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [33]:
y_1

array([0.78571429, 0.79324895, 0.79324895])

In [34]:
y_2 = cross_val_score(model_2,X_train,y_train,cv = 3, scoring = 'accuracy')
y_2

array([0.78991597, 0.76793249, 0.80590717])

In [35]:
from sklearn.ensemble import RandomForestClassifier
model_3 = RandomForestClassifier()

In [36]:
model_3.fit(X_train,y_train)
y_train_pred_3 = model_3.predict(X_train)

C:\Users\dell\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:246: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

In [37]:
cnfm_1 = confusion_matrix(y_train,y_train_pred_3)
cnfm_1

array([[438,   6],
       [ 17, 251]], dtype=int64)

In [38]:
y_3 = cross_val_score(model_3,X_train,y_train,cv = 3, scoring ='accuracy')
y_3

array([0.81512605, 0.76793249, 0.81012658])

In [39]:
data_1.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Family_Size,Fare_per_person,New_Variable
0,0,3,1,22.0,1,0,7.2500,S,1,3.62500,66.0
1,1,1,0,38.0,1,0,71.2833,C,1,35.64165,38.0
2,1,3,0,26.0,0,0,7.9250,S,0,7.92500,78.0
3,1,1,0,35.0,1,0,53.1000,S,1,26.55000,35.0
4,0,3,1,35.0,0,0,8.0500,S,0,8.05000,105.0

In [40]:
data_5 = data_1.copy()

In [41]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

In [42]:
data_5['Age'] = scaler.fit(data['Age'].values.reshape(-1,1))

In [43]:
data_5.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Family_Size,Fare_per_person,New_Variable
0,0,3,1,"StandardScaler(copy=True, with_mean=True, with...",1,0,7.2500,S,1,3.62500,66.0
1,1,1,0,"StandardScaler(copy=True, with_mean=True, with...",1,0,71.2833,C,1,35.64165,38.0
2,1,3,0,"StandardScaler(copy=True, with_mean=True, with...",0,0,7.9250,S,0,7.92500,78.0
3,1,1,0,"StandardScaler(copy=True, with_mean=True, with...",1,0,53.1000,S,1,26.55000,35.0
4,0,3,1,"StandardScaler(copy=True, with_mean=True, with...",0,0,8.0500,S,0,8.05000,105.0

In [44]:
data_5['Pclass'] = encoder_1.fit_transform(data_5['Pclass'].values.reshape(-1,1))

C:\Users\dell\Anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:371: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)

In [45]:
test_data = pd.read_csv('test.csv')

In [46]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [71]:
test_data_2 = test_data.drop(['PassengerId','Ticket','Cabin','Name'],axis = 1)

In [72]:

test_data_2.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [70]:
model_3.predict(test_data_1)

array([0, 0, 1, 1, 0], dtype=int64)

In [90]:
test_data_2 = test_data_2.dropna()
test_data_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 0 to 417
Data columns (total 9 columns):
Pclass             417 non-null int64
Sex                417 non-null int32
Age                417 non-null float64
SibSp              417 non-null int64
Parch              417 non-null int64
Fare               417 non-null float64
Family_Size        417 non-null int64
Fare_per_person    417 non-null float64
New_Variable       417 non-null float64
dtypes: float64(4), int32(1), int64(4)
memory usage: 30.9 KB

In [93]:
df = model_3.predict(test_data_2)

In [96]:
prediction = pd.DataFrame(df, columns=['predictions']).to_csv('prediction.csv')